; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-88)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 - object)
 (:init 
    (arm-empty)
    (clear b25)
    (on b25 b8)
    (on b8 b20)
    (on b20 b2)
    (on b2 b13)
    (on b13 b6)
    (on-table b6)
    (clear b22)
    (on b22 b17)
    (on b17 b5)
    (on b5 b15)
    (on b15 b12)
    (on b12 b3)
    (on b3 b14)
    (on b14 b9)
    (on b9 b1)
    (on b1 b16)
    (on b16 b21)
    (on b21 b19)
    (on b19 b26)
    (on b26 b23)
    (on b23 b11)
    (on b11 b24)
    (on b24 b18)
    (on b18 b4)
    (on b4 b7)
    (on b7 b10)
    (on-table b10))
 (:goal (and 
(on b25 b21)
))
)

; plan
1. (unstack b22 b17)
   deleted: (on b22 b17) (clear b22) (arm-empty)
   added: (holding b22) (clear b17)
   goals met: 0 of 1
2. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
3. (unstack b17 b5)
   deleted: (on b17 b5) (clear b17) (arm-empty)
   added: (holding b17) (clear b5)
   goals met: 0 of 1
4. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 0 of 1
5. (unstack b5 b15)
   deleted: (on b5 b15) (clear b5) (arm-empty)
   added: (holding b5) (clear b15)
   goals met: 0 of 1
6. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 1
7. (unstack b15 b12)
   deleted: (on b15 b12) (clear b15) (arm-empty)
   added: (holding b15) (clear b12)
   goals met: 0 of 1
8. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 0 of 1
9. (unstack b12 b3)
   deleted: (on b12 b3) (clear b12) (arm-empty)
   added: (holding b12) (clear b3)
   goals met: 0 of 1
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
11. (unstack b3 b14)
   deleted: (on b3 b14) (clear b3) (arm-empty)
   added: (holding b3) (clear b14)
   goals met: 0 of 1
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
13. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 0 of 1
14. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
15. (unstack b9 b1)
   deleted: (on b9 b1) (clear b9) (arm-empty)
   added: (holding b9) (clear b1)
   goals met: 0 of 1
16. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 0 of 1
17. (unstack b1 b16)
   deleted: (on b1 b16) (clear b1) (arm-empty)
   added: (holding b1) (clear b16)
   goals met: 0 of 1
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
19. (unstack b16 b21)
   deleted: (on b16 b21) (clear b16) (arm-empty)
   added: (holding b16) (clear b21)
   goals met: 0 of 1
20. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
21. (unstack b25 b8)
   deleted: (on b25 b8) (clear b25) (arm-empty)
   added: (holding b25) (clear b8)
   goals met: 0 of 1
22. (stack b25 b21)
   deleted: (clear b21) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b21)
   goals met: 1 of 1
